INSERT INTO public.departments (code,"name",created_at,"headerName") VALUES
	 ('ชย.','ช่างยนต์','2026-07-13 08:40:24.024802+07','นายบุญมี จันปัญญา'),
	 ('ชก.','ช่างกลโรงงาน','2026-07-13 08:40:49.817507+07','นายรักษ์พล มีด้วง'),
	 ('ชช.','ช่างเชื่อมโลหะ','2026-07-13 08:41:44.91128+07','นายยุทธพงษ์ เพชรเสถียร'),
	 ('ชฟ.','ช่างไฟฟ้า','2026-07-13 08:42:44.112071+07','นายยุทธนา นารายนะคามิน'),
	 ('ชอ.','ช่างอิเล็กทรอนิกส์','2026-07-13 08:43:13.713236+07','นายกัมปนาท ศรัทธาสุข'),
	 ('ชส.','ช่างก่อสร้าง โยธา','2026-07-13 08:43:42.478525+07','นายสุรศักดิ์ ราษี'),
	 ('สถ.','สถาปัตยกรรม','2026-07-13 08:44:01.379041+07','นางสาวกษิรา มหาศาลภิญโญ'),
	 ('ทค.','เทคโนโลยีคอมพิวเตอร์','2026-07-13 08:44:30.958616+07','นางจรัสศรี แก้วอาสา'),
	 ('ทส.','เทคโนโลยีสารสนเทศ','2026-06-16 15:33:32.307805+07','นายพิชญะ พรมลา'),
	 ('ทพ.','เทคโนโลยีพื้นฐานวิชาชีพ','2026-07-13 08:45:09.05898+07','นายสุริยันต์ นันตะรีสี');
INSERT INTO public.departments (code,"name",created_at,"headerName") VALUES
	 ('สม.','สามัญ สัมพันธ์','2026-07-13 08:45:35.273991+07','นางสิริวรรณ กริอุณะ');
